<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of the Lego Mindstorms Education EV3 Device Manager.</string>
	<key>Identifier</key>
	<string>com.github.dvtch.download.LegoMindstormsEducationEV3DeviceManager</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
        <string>EV3DeviceManager</string>
		<key>DOWNLOAD_URL</key>
		<string>https://ev3manager.education.lego.com/installers/EV3DeviceManager.pkg</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
						<key>Arguments</key>
		<dict>
		<key>url</key>
		<string>%DOWNLOAD_URL%</string>
		<key>filename</key>
		<string>%NAME%.pkg</string>
		</dict>
		</dict>
<dict>
<key>Processor</key>
<string>EndOfCheckPhase</string>
</dict>
<dict>
<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/*.pkg</string>
								<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: National Instruments (SKTKK2QZ74)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
			</dict>	
		</dict>
	</array>
</dict>
</plist>
